[
  {
    "id": 1,
    "title": "AI Assistant for Clinical History Quality",
    "category": "Healthcare",
    "status": "Active",
    "progress": 10,
    "description": "This project is dedicated to developing advanced AI-driven tools to support physicians during the clinical note-taking process. It is not intended to replace existing Electronic Health Record (EHR) systems, which remain the authoritative platforms for storing and managing clinical histories. Instead, our focus is on making the documentation process simpler, more comprehensive, and seamlessly coordinated with prior patient information. Key objectives include enabling real-time quality assessment of clinical notes against standard templates (such as SOAP or APSO) and custom configurations, as well as evaluating new entries for anomalies or inconsistencies when compared to the patient's historical record. To achieve these goals, our technical strategy addresses the challenges of unstructured healthcare data by employing Large Language Models (LLMs), semantic search, and graph databases. This approach creates a dynamic knowledge layer over patient data, mapping complex clinical relationships to ensure interoperability for enhanced diagnostic support and clinical research, all while adhering to strict data privacy and compliance standards. Our working group has made progress using models like MedGemma 27B to evaluate advanced clinical reasoning for improving clinical notes. Furthermore, we are assessing the performance of open-weight models on Spanish-language medical notes and applying Context Engineering techniques, such as variations of AutoMedPrompt, to improve note analysis.",
    "technologies": [
      "LLMs",
      "SOAP, APSO, DAP Notes",
      "Semantic Search",
      "Data Privacy",
      "Healthcare Compliance",
      "Graph Databases"
    ]
  },
  {
    "id": 10,
    "title": "AI Governance Tools",
    "category": "Business",
    "status": "Active",
    "progress": 12,
    "url": "/governance.html",
    "description": "This project is focused on developing practical tools and frameworks to support organizations in establishing effective AI governance. Leveraging AI platforms, our team conducts research and aggregates materials to create a foundational document for AI governance, risk management, and regulatory compliance. The primary objective is to equip organizations with resources that facilitate multi-stakeholder conversations, leading to the definition of clear guidelines for responsible and ethical AI adoption. Our approach emphasizes the creation of tools that help organizations implement best practices in AI governance, ensuring that responsible use, risk mitigation, and regulatory alignment are embedded in every initiative. By fostering collaborative dialogue and providing actionable frameworks, we aim to enable organizations to adopt AI in a manner that is both effective and aligned with ethical standards.",
    "technologies": [
      "Generative AI",
      "AI Ethics",
      "AI Governance"
    ]
  },
  {
    "id": 2,
    "title": "AI assisted tool to Learning and Training for Medical Professionals",
    "category": "Healthcare",
    "status": "Planning",
    "progress": 5,
    "description": "This initiative constitutes a formal investigation into the pedagogical applications of generative AI within medical education. The project will evaluate the efficacy of an AI-assisted adaptive learning platform designed to enhance the training of medical professionals. By leveraging specialized LLMs such as MedGemma, the system will generate personalized learning trajectories and provide real-time, context-aware feedback. The research will critically assess how cutting-edge AI models that process medical text and imagery can be used to create immersive and effective training modules, with a foundational analysis of the ethical considerations inherent in AI-mediated professional development [1].",
    "technologies": [
      "LLMs",
      "Generative AI",
      "AI Ethics",
      "MedGemma",
      "AI Engineering"
    ]
  },
  {
    "id": 3,
    "title": "Onboarding of Employee and Reskilling",
    "category": "Education",
    "status": "Active",
    "progress": 10,
    "description": "This research initiative is dedicated to mitigating knowledge deficits and accelerating the organizational assimilation of new personnel within medium to large enterprises. The project evaluates the efficacy of LLM-powered adaptive tutoring systems in creating personalized and efficient onboarding and reskilling pathways. A central focus is the development and validation of sophisticated prompt engineering strategies and AI-driven pedagogical frameworks to optimize knowledge transfer. The study also incorporates a critical examination of the ethical implications surrounding AI-mediated employee training and performance analytics [1].",
    "technologies": [
      "AI Engineering",
      "Prompt Engineering",
      "AI Ethics",
      "LLMs",
      "EEC"
    ]
  },
  {
    "id": 4,
    "title": "AI Workshop for Health Professionals",
    "category": "Healthcare",
    "status": "Active",
    "progress": 60,
    "description": "This workshop is architected for clinical leaders and health professionals poised to actively shape the next generation of AI-driven healthcare solutions. Participants will transcend the role of end-user to become integral co-designers of intelligent systems for diagnostics, professional training, and patient wellness. The workshop provides a comprehensive grounding in the operational principles of medical AI, including specialized LLMs and generative models, while focusing on practical application design and integration into clinical workflows. Key modules will cover the development of robust frameworks for data privacy, medico-legal compliance, and the ethical imperatives of deploying AI in patient care. The goal is to empower medical experts to use AI tools and to collaborate effectively with technical teams to conceptualize and validate AI assistants that address tangible clinical challenges.",
    "technologies": [
      "Medical AI",
      "Clinical Decision Support",
      "Generative AI",
      "Data Privacy & Governance",
      "AI Ethics",
      "AI Agents",
      "LLMs"
    ]
  },
  {
    "id": 5,
    "title": "Software Developer Onboarding",
    "category": "Business",
    "status": "Active",
    "progress": 8,
    "description": "This project investigates the foundational paradigms that new software developers must adopt to integrate effectively into unfamiliar development environments. The research is centered on two key aspects: enabling comprehensive understanding of existing code repositories and embracing a specification-driven development approach. By equipping new team members with advanced tools—such as intelligent documentation systems, code explorers, and context-aware assistants—the project aims to facilitate rapid assimilation of coding standards, architectural patterns, and best practices. However, its overarching goal is to affirm the irreplaceable value of the human developer: fostering creativity, critical problem-solving, and meaningful contributions that cannot be supplanted by automation. Through this dual focus, the initiative seeks to empower developers to become indispensable contributors, ensuring their skills and perspectives remain central even as teams adopt increasingly sophisticated AI-augmented workflows.",
    "technologies": [
      "AI Agents",
      "VSCode Extension",
      "Kiro IDE",
      "GIT",
      "RAG",
      "LLMs"
    ]
  },
  {
    "id": 6,
    "title": "AI for Unstructured Business Data",
    "category": "Business",
    "status": "Planning",
    "progress": 0,
    "description": "This initiative is focused on architecting an intelligent knowledge management framework to extract actionable insights from heterogeneous, unstructured corporate data sources such as reports, emails, and contracts. By synthesizing Retrieval-Augmented Generation (RAG), vector databases, and knowledge graphs, the project aims to construct a sophisticated semantic search and data analysis layer. A pivotal goal is the seamless integration of this structured intelligence into enterprise systems like Business Process Management Systems (BPMS) and Headless CMS, thereby transforming inert data archives into dynamic assets that drive process automation and strategic decision-making [1].",
    "technologies": [
      "RAG",
      "Vector DB",
      "LLM",
      "Semantic Search",
      "Knowledge Graphs",
      "BPMS",
      "CMS Headless"
    ]
  },
  {
    "id": 7,
    "title": "Mini-pilot AI Tools for Senior Support",
    "category": "Healthcare",
    "status": "Completed",
    "progress": 100,
    "description": "This concluded pilot project encompassed the design, implementation, and empirical assessment of an assistive AI technology tailored for older adults. The research objective was to evaluate the effectiveness of user-centric AI in augmenting the autonomy of seniors in daily activities. The solution employed multimodal interfaces, specifically leveraging voice-driven AI and video capture analysis powered by the Gemini LLM. Foundational to its design was a rigorous application of accessibility engineering principles to ensure high usability and foster adoption within the target demographic, aligning with the lab's mission of creating socially impactful technology [1].",
    "team": [
      "Felipe Valencia USA"
    ],
    "technologies": [
      "Gemini LLM",
      "Voice AI",
      "Accessibility Tech"
    ]
  },
  {
    "id": 8,
    "title": "AI Tools for Senior Support",
    "category": "Healthcare",
    "status": "Planning",
    "progress": 0,
    "description": "Building upon the empirical findings from the initial mini-pilot, this project will architect a second-generation AI companion for senior care. This planning phase is focused on the conceptual design of a more sophisticated, proactive system utilizing autonomous AI agents and advanced LLMs. The research will investigate methodologies for delivering personalized, context-aware support that extends beyond simple task execution to include cognitive engagement and wellness monitoring. The ultimate aim is to address complex challenges in elder care through a scalable, ethically-grounded technological solution [1].",
    "technologies": [
      "AI Agents",
      "LLMs"
    ]
  },
  {
    "id": 9,
    "title": "AI Workshop for Teachers and Educators",
    "category": "Education",
    "status": "Active",
    "progress": 55,
    "description": "This workshop is designed for pioneering educators who wish to transition from being users of AI to creators of bespoke AI-driven pedagogical tools. Participants will engage in a rigorous exploration of the theoretical underpinnings and practical design of various AI classroom archetypes, including  AI-tutors, AI-coachs, AI-mentors, AI-teammates, AI-tools, AI-simulators, and AI-students. The workshop moves beyond basic AI interaction to focus on the entire co-creation lifecycle: from identifying pedagogical needs to use, designing, prototyping, and deploying intelligent systems that foster critical thinking and personalized learning. We will critically analyze the affordances, risks, and ethical frameworks required to deploy AI solutions tailored to specific school and student contexts.",
    "technologies": [
      "Generative AI",
      "AI Ethics",
      "AI Learning",
      "AI Agents",
      "LLMs"
    ]
  },
  {
    "id": 11,
    "title": "AI Digital Twins Scope and Viability in Enterprise Solutions",
    "category": "Business",
    "status": "Active",
    "progress": 0,
    "description": "This research initiative explores the strategic implementation and commercial viability of AI-powered digital twins within enterprise environments. The project investigates how digital twin technology can be enhanced through advanced AI capabilities to create dynamic, real-time virtual representations of physical assets, processes, and systems. Key focus areas include evaluating the technical feasibility of integrating machine learning models, and predictive analytics to enable proactive decision-making and operational optimization. The research will assess implementation challenges, ROI potential, and scalability considerations across various industry verticals including manufacturing, supply chain, and resource management. A critical component involves developing frameworks for data integration, model validation, and continuous learning to ensure digital twins remain accurate and actionable representations of their physical counterparts.",
    "technologies": [
      "Digital Twin Technology",
      "Machine Learning",
      "Predictive Analytics"
    ]
  }
]